"1 127 1 4206624770 ,"
"input0 1 3 240 320 ,"
" 302 303 305 306 308 309 311 312 314 315 317 318 320 321 323 324 326 327 329 330 332 333 335 336 338 339 341 342 344 345 347 348 350 351 353 354 356 357 359 360 362 363 365 366 368 369 371 372 374 375 377 378 380 381 383 384 386 387 389 390 409 410 412 413 432 433 435 436 438 440 441 443 445 446 448 449 450 452 454 455 457 459 460 462 463 464 466 468 469 471 473 474 476 477 478 479 480 490 491 492 502 503 504 514 516 517 527 528 529 539 540 541 551 552 553 554 564 565 566 576 577 578 588 input0 landms loc score ,"
"loc score landms ,"
" 126 ,"
"Convolution Conv_0 1 1 input0 302 1 3 8 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_2 1 1 302 303 ,"
"Convolution Conv_3 1 1 303 305 8 1 8 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_5 1 1 305 306 ,"
"Convolution Conv_6 1 1 306 308 1 8 16 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_8 1 1 308 309 ,"
"Convolution Conv_9 1 1 309 311 16 1 16 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_11 1 1 311 312 ,"
"Convolution Conv_12 1 1 312 314 1 16 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_14 1 1 314 315 ,"
"Convolution Conv_15 1 1 315 317 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_17 1 1 317 318 ,"
"Convolution Conv_18 1 1 318 320 1 32 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_20 1 1 320 321 ,"
"Convolution Conv_21 1 1 321 323 32 1 32 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_23 1 1 323 324 ,"
"Convolution Conv_24 1 1 324 326 1 32 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_26 1 1 326 327 ,"
"Convolution Conv_27 1 1 327 329 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_29 1 1 329 330 ,"
"Convolution Conv_30 1 1 330 332 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_32 1 1 332 333 ,"
"Convolution Conv_33 1 1 333 335 64 1 64 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_35 1 1 335 336 ,"
"Convolution Conv_36 1 1 336 338 1 64 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_38 1 1 338 339 ,"
"Convolution Conv_39 1 1 339 341 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_41 1 1 341 342 ,"
"Convolution Conv_42 1 1 342 344 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_44 1 1 344 345 ,"
"Convolution Conv_45 1 1 345 347 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_47 1 1 347 348 ,"
"Convolution Conv_48 1 1 348 350 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_50 1 1 350 351 ,"
"Convolution Conv_51 1 1 351 353 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_53 1 1 353 354 ,"
"Convolution Conv_54 1 1 354 356 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_56 1 1 356 357 ,"
"Convolution Conv_57 1 1 357 359 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_59 1 1 359 360 ,"
"Convolution Conv_60 1 1 360 362 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_62 1 1 362 363 ,"
"Convolution Conv_63 1 1 363 365 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_65 1 1 365 366 ,"
"Convolution Conv_66 1 1 366 368 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_68 1 1 368 369 ,"
"Convolution Conv_69 1 1 369 371 128 1 128 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_71 1 1 371 372 ,"
"Convolution Conv_72 1 1 372 374 1 128 256 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_74 1 1 374 375 ,"
"Convolution Conv_75 1 1 375 377 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_77 1 1 377 378 ,"
"Convolution Conv_78 1 1 378 380 1 256 256 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_80 1 1 380 381 ,"
"Convolution Conv_81 1 1 333 383 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_83 1 1 383 384 ,"
"Convolution Conv_84 1 1 369 386 1 128 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_86 1 1 386 387 ,"
"Convolution Conv_87 1 1 381 389 1 256 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_89 1 1 389 390 ,"
"Upsample Resize_108 1 1 390 409 1 0 0 0 15 20 ,"
"Add Add_109 2 1 387 409 410 ,"
"Convolution Conv_110 1 1 410 412 1 64 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_112 1 1 412 413 ,"
"Upsample Resize_131 1 1 413 432 1 0 0 0 30 40 ,"
"Add Add_132 2 1 384 432 433 ,"
"Convolution Conv_133 1 1 433 435 1 64 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_135 1 1 435 436 ,"
"Convolution Conv_136 1 1 436 438 1 64 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_138 1 1 436 440 1 64 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_140 1 1 440 441 ,"
"Convolution Conv_141 1 1 441 443 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_143 1 1 441 445 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_145 1 1 445 446 ,"
"Convolution Conv_146 1 1 446 448 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Concat Concat_148 3 1 438 443 448 449 1 ,"
"ReLU Relu_149 1 1 449 450 ,"
"Convolution Conv_150 1 1 413 452 1 64 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_152 1 1 413 454 1 64 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_154 1 1 454 455 ,"
"Convolution Conv_155 1 1 455 457 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_157 1 1 455 459 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_159 1 1 459 460 ,"
"Convolution Conv_160 1 1 460 462 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Concat Concat_162 3 1 452 457 462 463 1 ,"
"ReLU Relu_163 1 1 463 464 ,"
"Convolution Conv_164 1 1 390 466 1 64 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_166 1 1 390 468 1 64 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_168 1 1 468 469 ,"
"Convolution Conv_169 1 1 469 471 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_171 1 1 469 473 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_173 1 1 473 474 ,"
"Convolution Conv_174 1 1 474 476 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Concat Concat_176 3 1 466 471 476 477 1 ,"
"ReLU Relu_177 1 1 477 478 ,"
"Convolution Conv_178 1 1 450 479 1 64 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_179 1 1 479 480 4 0 2 3 1 ,"
"Reshape Reshape_185 1 1 480 490 0 4 4 0 -1 4 1 ,"
"Convolution Conv_186 1 1 464 491 1 64 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_187 1 1 491 492 4 0 2 3 1 ,"
"Reshape Reshape_193 1 1 492 502 0 4 4 0 -1 4 1 ,"
"Convolution Conv_194 1 1 478 503 1 64 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_195 1 1 503 504 4 0 2 3 1 ,"
"Reshape Reshape_201 1 1 504 514 0 4 4 0 -1 4 1 ,"
"Concat Concat_202 3 1 490 502 514 loc 1 ,"
"Convolution Conv_203 1 1 450 516 1 64 4 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_204 1 1 516 517 4 0 2 3 1 ,"
"Reshape Reshape_210 1 1 517 527 0 4 4 0 -1 2 1 ,"
"Convolution Conv_211 1 1 464 528 1 64 4 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_212 1 1 528 529 4 0 2 3 1 ,"
"Reshape Reshape_218 1 1 529 539 0 4 4 0 -1 2 1 ,"
"Convolution Conv_219 1 1 478 540 1 64 4 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_220 1 1 540 541 4 0 2 3 1 ,"
"Reshape Reshape_226 1 1 541 551 0 4 4 0 -1 2 1 ,"
"Concat Concat_227 3 1 527 539 551 552 1 ,"
"Convolution Conv_228 1 1 450 553 1 64 20 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_229 1 1 553 554 4 0 2 3 1 ,"
"Reshape Reshape_235 1 1 554 564 0 4 4 0 -1 10 1 ,"
"Convolution Conv_236 1 1 464 565 1 64 20 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_237 1 1 565 566 4 0 2 3 1 ,"
"Reshape Reshape_243 1 1 566 576 0 4 4 0 -1 10 1 ,"
"Convolution Conv_244 1 1 478 577 1 64 20 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_245 1 1 577 578 4 0 2 3 1 ,"
"Reshape Reshape_251 1 1 578 588 0 4 4 0 -1 10 1 ,"
"Concat Concat_252 3 1 564 576 588 landms 1 ,"
"SoftmaxCaffe Softmax_253 1 1 552 score 2 ,"
